Tekla Open API Reference for Tekla Structures 2025
Localization.LoadFile Method
 Loads the localization strings from a file. Several files may be used concurrently, just call LoadFile for each file. The translations are searched in the loading order and the first match is returned. The method uses the extension of the filename to identify the file type (".xml", ".aid" or ".ail").
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void LoadFile(
	string fileName
)
Public Sub LoadFile (
	fileName As String
)
Parameters
fileName
Type: System.String
The file to be loaded.
See Also
Reference
Localization Class
Tekla.Structures.Dialog Namespace